Revit 2024 API
ParameterTypeId.BoundaryLinearRestraintX Property
 "X Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryLinearRestraintX { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryLinearRestraintX As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryLinearRestraintX {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace